tekkura/sr-firmware/src/rp2040_log.c
#include <stdarg.h>
#include <stdint.h>
#include <stdio.h>
#include "pico/mutex.h"
#include "pico/types.h"
#include <string.h>
#include "rp2040_log.h"
#include "pico/multicore.h"
#include "hardware/uart.h"
#include "hardware/gpio.h"
#include "crc.h"

// Use the UART definitions from CMakeLists.txt
#if PICO_DEFAULT_UART == 0
#define LOG_UART uart0
#else
#define LOG_UART uart1
#endif
#define LOG_UART_TX_PIN PICO_DEFAULT_UART_TX_PIN
#define LOG_UART_RX_PIN PICO_DEFAULT_UART_RX_PIN
static CircularBufferLog log_buffer;
auto_init_mutex(rp2040_log_buffer_mutex);

static bool rp2040_log_buffer_is_empty() {
    return log_buffer.count == 0;
}

static uint16_t rp2040_log_payload_size(uint16_t line_size) {
    return line_size > 0 ? line_size - 1 : 0;
}

static void rp2040_log_drop_oldest() {
    if (rp2040_log_buffer_is_empty()) {
        return;
    }

    uint16_t payload_size = rp2040_log_payload_size(log_buffer.log_array_line_size[log_buffer.head]);
    if (payload_size > log_buffer.byte_count) {
        log_buffer.byte_count = 0;
    } else {
        log_buffer.byte_count -= payload_size;
    }

    log_buffer.log_array_line_size[log_buffer.head] = 0;
    log_buffer.head = (log_buffer.head + 1) % LOG_BUFFER_LINE_COUNT;
    log_buffer.count--;
    if (rp2040_log_buffer_is_empty()) {
        log_buffer.tail = log_buffer.head;
    }
}

static void rp2040_log_make_room(uint16_t payload_size) {
    while (log_buffer.count == LOG_BUFFER_LINE_COUNT ||
           (uint32_t)log_buffer.byte_count + payload_size > UINT16_MAX) {
        rp2040_log_drop_oldest();
    }
}

// Initialize the circular buffer
void rp2040_log_init() {
    memset(&log_buffer, 0, sizeof(log_buffer));
    log_buffer.head = 0; 
    log_buffer.tail = 0;
    log_buffer.count = 0;
    
    #ifdef LOGGER_UART
    // Initialize dedicated UART for logging (separate from stdio)
    uart_init(LOG_UART, 115200);
    gpio_set_function(LOG_UART_TX_PIN, GPIO_FUNC_UART);
    gpio_set_function(LOG_UART_RX_PIN, GPIO_FUNC_UART);
    #endif
}

void rp2040_log_acquire_lock() {
    mutex_enter_blocking(&rp2040_log_buffer_mutex);
}

void rp2040_log_release_lock() {
    mutex_exit(&rp2040_log_buffer_mutex);
}


void rp2040_log(int level, const char* format, ...) {
    if (level < LOG_LEVEL) return;

    rp2040_log_acquire_lock(); // Acquire the lock
    va_list args;

    #ifdef LOGGER_UART
    // For UART mode, log directly to UART hardware (not stdio)
    char buffer[256];
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);
    
    // Send directly to UART0 on GPIO16/17
    uart_puts(LOG_UART, buffer);
    rp2040_log_release_lock(); // Release the lock
    return;
    #endif

    va_start(args, format);
    // Calculate the number of characters required
    int len = vsnprintf(NULL, 0, format, args) + 1; //include the /n
    va_end(args);

    // truncate the message if it is too long else expect chaos when overwriting unknown areas of memory
    if (len > LOG_BUFFER_CHAR_LIMIT) {
	len = LOG_BUFFER_CHAR_LIMIT;
    }

    uint16_t payload_size = rp2040_log_payload_size(len);
    rp2040_log_make_room(payload_size);

    // Format the message and copy it to the buffer, handling wrapping
    va_start(args, format); // Restart the argument list
    vsnprintf(log_buffer.log_array[log_buffer.tail], len, format, args);
    va_end(args);

    log_buffer.log_array_line_size[log_buffer.tail] = len; // store the size of the line -2 for removing \n and null terminator
    log_buffer.byte_count += payload_size;
    log_buffer.count++;
    log_buffer.tail = (log_buffer.tail + 1) % LOG_BUFFER_LINE_COUNT; // Update tail correctly

    rp2040_log_release_lock(); // Release the lock
}

// Function to retrieve the total number of bytes within the log_array
uint16_t rp2040_get_byte_count() {
   return log_buffer.byte_count;
}

// Function to retrieve the crc value of log commands
uint16_t rp2040_get_crc(uint16_t initial_crc) {
    uint16_t crc = initial_crc;
    uint16_t current = log_buffer.head;

    for (int i = 0; i < LOG_BUFFER_LINE_COUNT; i++) {
        uint16_t size = log_buffer.log_array_line_size[current];
        if (size > 1) {
            // Calculate CRC for this specific line (excluding null terminator)
            crc = crc16_ccitt((uint8_t*)log_buffer.log_array[current], size - 1, crc);
        }
        current = (current + 1) % LOG_BUFFER_LINE_COUNT;
    }
    return crc;
}

void rp2040_log_flush(){
    if (rp2040_log_buffer_is_empty()) {
        return;
    }

    // Print only populated entries within the live ring segment.
    uint16_t index = log_buffer.head;
    for (uint16_t i = 0; i < log_buffer.count; i++) {
        uint16_t line_size = log_buffer.log_array_line_size[index];
        if (line_size > 0) {
            printf("%.*s", line_size, log_buffer.log_array[index]);
        }
        index = (index + 1) % LOG_BUFFER_LINE_COUNT;
    }

    // Drain the buffer so the next GET_LOG only reports new entries.
    log_buffer.head = 0;
    log_buffer.tail = 0;
    log_buffer.count = 0;
    log_buffer.byte_count = 0;
}
